+++
title = "关于"
description = "关于作者及本站"
keywords = ["简历","刘学军","网站架构","兴趣爱好"]
+++
***
### 我是谁  
***
&emsp;&emsp;我是一名业余数据分析爱好者，毕业于河北大学文学院中文专业古典文献方向，现就职于一家银行。  
&emsp;&emsp;数据分析、中文，银行一种奇怪的组合啊，原因嘛得从头说起。小学时条件艰苦，学校班级是一种复式班，全班三十个人不到，教室左面一年级，右面三年级，老师上完三年级的课再给一年级上。初三复习班前没想过一直上学，走考大学这条路，全村就八十年代有一个大学生，其余都是小学或初中就辍学打工了。上高中时痴迷于哲学、经济学（仅限于一知半解），故而选择了文科。高考报考国际经济与贸易专业（幸亏没去成），结果调剂到中文专业。现在才发现能学中文是人生的一大幸事，文学可以赋予一个人灵魂，从自我中发现意义，实现自我教育自我洗礼从而变得自立自强。大学时年少轻狂，考北大研究生（好高骛远），转专业考南开金融研究生（贼心不死），结果失败，北漂，回老家进入一家银行。  
&emsp;&emsp;自己是那种内向驱动型性格，喜欢思考、创新，由金融到对数据科学感兴趣，到R语言的学习，到了解blogdown，从而开始创建自己的博客。我想写博客是对自己的一种解构与构建，是自我的不断革新。  

>《易經·系辭》:“形而上者謂之道，形而下者謂之器”。  
《論語·為政》:子曰:“君子不器。”  
魏源說：“技可進乎道，藝可通乎神;中人可易為上智，凡夫亦可祁天永年;造化自我立焉。”

&emsp;&emsp;形而上是无形的道体，形而下是万物各自的象、用。器与道是体用之别，可以技进乎道，亦可道而后器。

>湯之《盤銘》曰：“茍日新，日日新，又日新。”《康誥》曰：“作新民。”《詩》曰：“周雖舊邦，其命維新。”是故君子無所不用其極。

&emsp;&emsp;希望通过通过博客的写作做达到“茍日新，日日新，又日新”的状态，也骐骥由文学、经济学、编程而技进乎道，道而后器。“洗心革面”总是痛苦的，谨以辛弃疾的一首词来自勉：

>青玉案·元夕

>【南宋】辛棄疾

>東風夜放花千樹，更吹落，星如雨，寶馬雕車香滿路。鳳簫聲動，玉壺光轉，一夜魚龍舞。  

>蛾兒雪柳黃金縷，笑語盈盈暗香去。眾裏尋他千百度，驀然回首，那人卻在，燈火闌珊處。  

***
### 兴趣爱好    
***

* 哲学方面偏爱儒学，诸子次之，世界哲学偏爱尼采，黑格尔、康德次之。  
* 文学方面从前偏好浪漫主义作品，而今更爱读现实主义作品。喜欢庄子、屈原、李白、海子，更爱诗经、乐府、杜甫、余华。  
* 喜欢数学、金融学，但学识也有限。  
* 计算机方面，出于兴趣爱好，从excel转而学习R语言，感兴趣的领域有：   
     * 自动化报告  
     * 可视化   
     * 商业及金融数据分析  
     
     
***
### 精神血统      
***
##### 喜欢的人：    
木心、王阳明、庄子、杜甫、毛泽东、鲁迅、纪德
##### 从前喜欢的人：  
余秋雨、史作柽、纳兰容若、马尔克斯    

***
### 技能        
***
##### 写作：
够用，喜欢创作，不喜欢公文  
##### 计算机：  
office、photoshop、premiere等各类软件；R语言。
##### 会计：  
够用  
##### 英语： 
CET-6，阅读顺畅，听力一般，口语差劲。
##### 证书：
* 一堆废纸：银行从业资格证初级6门、中级2门；期货、基金、债券、会计、黄金从业资格证。
* 计划考取：CPA FRM 

***
### 本站架构  
***
&emsp;&emsp;本站使用[谢益辉](https://yihui.name/)R包[blogdown](https://github.com/rstudio/blogdown)搭建。blogdown博客后台生成系统是[hugo](https://gohugo.io/)，它利用了hugo快速生成静态网站的便利性，又可以便捷的使用[rmarkdown](https://rmarkdown.rstudio.com/)插入代码及代码运行结果。本站使用的模板是hugo主题[universal](https://themes.gohugo.io/hugo-universal-theme/)，网站推送到[github](https://github.com/)，然后同步到[netlify](https://www.netlify.com/)发布。关于如何使用blogdown搭建博客，参见谢益辉电子书[blogdown: Creating Websites with R Markdown](https://bookdown.org/yihui/blogdown/),有时间写一篇详细的中文教程。  
使用软件及网站：  

* [Rstudio](https://www.rstudio.com/)  
* [blogdown](https://github.com/rstudio/blogdown)  
* [hugo](https://gohugo.io/)  
* [github](https://github.com/)  
* [netlify](https://www.netlify.com/)  

